---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCommonRunGenerateLayoutFailure
source: html/a75243b1-b9eb-b26f-95bf-3c8d83a47ada.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCommonRunGenerateLayoutFailure Property

Fail to get base line thus fail to generate run layout

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsCommonRunGenerateLayoutFailure { get; }
```